# PANDAS

Pandas is a popular Python library for data manipulation and analysis. It provides data structures like DataFrame and Series, which are efficient for working with structured data.

##### Pandas provides two types of classes for handling data:

**Series**: a one-dimensional labeled array holding data of any type
such as integers, strings, Python objects etc.

**DataFrame**: a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1, 3, 5, 4, 6, 8])

In [4]:
s

0    1
1    3
2    5
3    4
4    6
5    8
dtype: int64

In [5]:
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   28    Los Angeles

In [6]:
labels = ['a', 'b', 'c']
my_data = [1,2,4]

In [7]:
pd.Series(data=my_data)

0    1
1    2
2    4
dtype: int64

In [8]:
pd.Series(data=my_data, index=labels)

a    1
b    2
c    4
dtype: int64

In [9]:
pd.Series(my_data, labels)

a    1
b    2
c    4
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4], ["AUS", "CAN", "GER", "USA"])

In [11]:
ser1

AUS    1
CAN    2
GER    3
USA    4
dtype: int64

In [12]:
ser1['USA']

4

In [5]:
df = pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A -0.222193 -1.032032  1.614747 -1.760523
B  0.233217  0.116356 -0.731448 -1.285845
C -0.848058  0.484462  0.933078  0.142429
D  0.707640 -1.998197 -0.796202  0.359056
E  0.613003  0.555384  0.780592  0.338708

In [7]:
df['W']

A   -0.222193
B    0.233217
C   -0.848058
D    0.707640
E    0.613003
Name: W, dtype: float64

In [8]:
df[['W', 'Z']]

          W         Z
A -0.222193 -1.760523
B  0.233217 -1.285845
C -0.848058  0.142429
D  0.707640  0.359056
E  0.613003  0.338708

In [9]:
df['new'] = df['W'] + df['Z']

In [10]:
df

          W         X         Y         Z       new
A -0.222193 -1.032032  1.614747 -1.760523 -1.982716
B  0.233217  0.116356 -0.731448 -1.285845 -1.052628
C -0.848058  0.484462  0.933078  0.142429 -0.705630
D  0.707640 -1.998197 -0.796202  0.359056  1.066696
E  0.613003  0.555384  0.780592  0.338708  0.951710

In [11]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.222193 -1.032032  1.614747 -1.760523
B  0.233217  0.116356 -0.731448 -1.285845
C -0.848058  0.484462  0.933078  0.142429
D  0.707640 -1.998197 -0.796202  0.359056
E  0.613003  0.555384  0.780592  0.338708

In [12]:
df.drop('E', axis=0)

          W         X         Y         Z       new
A -0.222193 -1.032032  1.614747 -1.760523 -1.982716
B  0.233217  0.116356 -0.731448 -1.285845 -1.052628
C -0.848058  0.484462  0.933078  0.142429 -0.705630
D  0.707640 -1.998197 -0.796202  0.359056  1.066696

In [15]:
df['W'].loc['A']

-0.22219277620527791

In [14]:
df.iloc[2]

W     -0.848058
X      0.484462
Y      0.933078
Z      0.142429
new   -0.705630
Name: C, dtype: float64

In [23]:
df.loc['B', 'X']

0.566671212773692

In [24]:
df > 0

       W      X      Y      Z    new
A  False   True   True  False  False
B  False   True  False   True   True
C   True  False  False   True   True
D   True   True  False   True   True
E  False   True   True  False  False

In [25]:
isPos = df > 0

In [26]:
df[isPos]

          W         X         Y         Z       new
A       NaN  0.707264  1.412335       NaN       NaN
B       NaN  0.566671       NaN  2.039543  1.106790
C  0.104399       NaN       NaN  1.097924  1.202323
D  0.708580  0.439634       NaN  1.147330  1.855910
E       NaN  2.261836  1.609027       NaN       NaN

In [27]:
df[df['W']>0]

          W         X         Y         Z       new
C  0.104399 -0.611883 -0.000887  1.097924  1.202323
D  0.708580  0.439634 -0.054199  1.147330  1.855910

In [28]:
county_list = "AUS USA CAN GER NEP UK"

In [30]:
county_list.split()

['AUS', 'USA', 'CAN', 'GER', 'NEP', 'UK']

# MISSING DATA

In [38]:
d = { 'A':[1,np.nan,3], 'B':[4,np.nan,np.nan], 'C':[6,7, 8]}

In [39]:
data = pd.DataFrame(d)

In [40]:
data

     A    B  C
0  1.0  4.0  6
1  NaN  NaN  7
2  3.0  NaN  8

In [41]:
data.dropna()

     A    B  C
0  1.0  4.0  6

In [42]:
data.dropna(axis=1)

   C
0  6
1  7
2  8

In [47]:
data.dropna(axis=1, thresh=2)

     A  C
0  1.0  6
1  NaN  7
2  3.0  8

In [48]:
data.fillna(value="1")

   A  B  C
0  1  4  6
1  1  1  7
2  3  1  8

In [51]:
data['A'].fillna(value=data['A'].mean(), inplace=True)

In [54]:
data

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  3.0  NaN  8

In [69]:
d = { 'Company':["ABC","DEF","ABC","DEF"], 'Sales':[4000,15000,2000,3500], 'Product':['SAAS','Service', 'BAAS','SAAS']}

In [70]:
df = pd.DataFrame(d)

In [71]:
df

  Company  Sales  Product
0     ABC   4000     SAAS
1     DEF  15000  Service
2     ABC   2000     BAAS
3     DEF   3500     SAAS

In [72]:
byComp = df.groupby('Company')

In [73]:
byComp.mean()

         Sales
Company
ABC       3000
DEF       9250

In [74]:
byProd = df.groupby('Product')

In [75]:
byProd.mean()

         Sales
Product
BAAS      2000
SAAS      3750
Service  15000

In [76]:
df.describe()

              Sales
count      4.000000
mean    6125.000000
std     5977.387947
min     2000.000000
25%     3125.000000
50%     3750.000000
75%     6750.000000
max    15000.000000

In [4]:
df1 = pd.DataFrame({
    'A': [1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}, index=[1,2,3])

In [11]:
df2 = pd.DataFrame({
    'A': ['a','b','c'],
    'B':['d','e','f'],
    'D':['g','h','i']
}, index=[1,2,3])

In [12]:
df1

   A  B  C
1  1  4  7
2  2  5  8
3  3  6  9

In [13]:
df2

   A  B  D
1  a  d  g
2  b  e  h
3  c  f  i

# CONCATENATION

- Glues together dataframes
- Keep in Mind only dimension matcher
- pd.concat([1,2,3])

In [14]:
concat_data = pd.concat([df1,df2])
concat_data

/home/evazs/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   A  B    C    D
1  1  4  7.0  NaN
2  2  5  8.0  NaN
3  3  6  9.0  NaN
1  a  d  NaN    g
2  b  e  NaN    h
3  c  f  NaN    i

In [24]:
concat_data = pd.concat([df1,df2], axis=1)
concat_data

     A    B    C    A    B    C
1  1.0  4.0  7.0  NaN  NaN  NaN
2  2.0  5.0  8.0  NaN  NaN  NaN
3  3.0  6.0  9.0  NaN  NaN  NaN
4  NaN  NaN  NaN    a    d    g
5  NaN  NaN  NaN    b    e    h
6  NaN  NaN  NaN    c    f    i

In [38]:
df1 = pd.DataFrame({
    'A': [1,2,3],
    'B':[4,5,6],
    'key':[7,8,10]
}, index=[1,2,3])

In [39]:
df2 = pd.DataFrame({
    'C': ['a','b','c'],
    'D':['d','e','f'],
    'key':[7,8,9]
}, index=[4,5,6])

In [40]:
df1

   A  B  key
1  1  4    7
2  2  5    8
3  3  6   10

In [41]:
df2

   C  D  key
4  a  d    7
5  b  e    8
6  c  f    9

# MERGE

Merge dataframe together same like in SQL

In [42]:
pd.merge(df1, df2, how="inner", on="key")

   A  B  key  C  D
0  1  4    7  a  d
1  2  5    8  b  e

In [50]:
pd.merge(df1, df2, how="outer", on="key")

     A    B  key    C    D
0  1.0  4.0    7    a    d
1  2.0  5.0    8    b    e
2  3.0  6.0   10  NaN  NaN
3  NaN  NaN    9    c    f

In [51]:
pd.merge(df1, df2, how="left", on="key")

   A  B  key    C    D
0  1  4    7    a    d
1  2  5    8    b    e
2  3  6   10  NaN  NaN

In [52]:
pd.merge(df1, df2, how="right", on="key")

     A    B  key  C  D
0  1.0  4.0    7  a  d
1  2.0  5.0    8  b  e
2  NaN  NaN    9  c  f

# JOINING
Differently Indexed Dataframe

In [54]:
# Creating two DataFrames
df1 = pd.DataFrame({'value1': [1, 2, 3, 4]}, index=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame({'value2': [5, 6, 7, 8]}, index=['B', 'D', 'E', 'F'])

# Join based on the index
joined_df = df1.join(df2, how='inner')

In [56]:
joined_df = df1.join(df2, how='left')

In [57]:
joined_df

   value1  value2
A       1     NaN
B       2     5.0
C       3     NaN
D       4     6.0

# OPERATIONS

In [14]:
data = {
    'Category': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'A'],
    'Value': [10, 20, 10, 30, 20, 15, 25, 15],
    'Status': ['OK', 'OK', 'Fail', 'OK', 'Fail', 'OK', 'OK', 'Fail']
}

df = pd.DataFrame(data)

In [17]:
df['Status'].unique()

array(['OK', 'Fail'], dtype=object)

In [62]:
len(df['Status'].unique())

2

In [63]:
df['Status'].nunique()

2

In [64]:
df['Status'].value_counts()

OK      5
Fail    3
Name: Status, dtype: int64

In [68]:
df['Value']>20

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
Name: Value, dtype: bool

In [69]:
(df['Value']>20).value_counts()

False    6
True     2
Name: Value, dtype: int64

In [70]:
df['Value'].sum()

145

In [71]:
def time2(x):
    return x*2

In [72]:
df['Value'].apply(time2)

0    20
1    40
2    20
3    60
4    40
5    30
6    50
7    30
Name: Value, dtype: int64

In [74]:
df['Value'].apply(lambda x:x*2)

0    20
1    40
2    20
3    60
4    40
5    30
6    50
7    30
Name: Value, dtype: int64

In [18]:
df.drop('Value', axis=1)

  Category Status
0        A     OK
1        B     OK
2        A   Fail
3        C     OK
4        B   Fail
5        A     OK
6        C     OK
7        A   Fail

In [19]:
df.drop(0, axis=0)

  Category  Value Status
1        B     20     OK
2        A     10   Fail
3        C     30     OK
4        B     20   Fail
5        A     15     OK
6        C     25     OK
7        A     15   Fail

In [80]:
df

  Category  Value Status
0        A     10     OK
1        B     20     OK
2        A     10   Fail
3        C     30     OK
4        B     20   Fail
5        A     15     OK
6        C     25     OK
7        A     15   Fail

In [81]:
df.columns

Index(['Category', 'Value', 'Status'], dtype='object')

In [82]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [21]:
df.sort_values('Status')

  Category  Value Status
2        A     10   Fail
4        B     20   Fail
7        A     15   Fail
0        A     10     OK
1        B     20     OK
3        C     30     OK
5        A     15     OK
6        C     25     OK

In [85]:
df.isnull()

   Category  Value  Status
0     False  False   False
1     False  False   False
2     False  False   False
3     False  False   False
4     False  False   False
5     False  False   False
6     False  False   False
7     False  False   False

# INPUT & IMPORT

In [5]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
data = {
    'Category': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'A'],
    'Value': [10, 20, 10, 30, 20, 15, 25, 15],
    'Status': ['OK', 'OK', 'Fail', 'OK', 'Fail', 'OK', 'OK', 'Fail']
}

df = pd.DataFrame(data)


df.to_csv('cat.csv',index=False)

In [10]:
pd.read_excel('Excel_Sample.xlsx' )

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [3]:
pd.read_excel('Excel_Sample.xlsx', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
df.head(2)

   a  b  c  d
0  0  1  2  3
1  4  5  6  7